$(document).on("keydown", ".trans", function(e) {
	
	if ((e.ctrlKey || e.metaKey) && e.keyCode === 71) {
		
		e.preventDefault();
		
		$(this).val(function(i,val) {
		
			var f = ["א~", "א>", "א_", "א9", "ה'","ו'","א'","א%","י'","ת'","ג'","ח'","ד'","צ'","ט'","ע'","א","ב","ת","ג","ח","ד","ר","ז","ס","ש","צ","ט","ע","פ","ק","כ","ל","מ","נ","ה","ו","י","ם","ן","ך","ץ'","ץ","ף", ">>", ">", "@", "__", "_", "%%", "%", "W"];
			var r = ["آ", "أ", "إ", "ٱ", "ة","ؤ","ء","ى","ئ","ث","ج","خ","ذ","ض","ظ","غ","ا","ب","ت","ج","ح","د","ر","ز","س","ش","ص","ط","ع","ف","ق","ك","ل","م","ن","ه","و","ي","م","ن","ك","ض","ص","ف", "ً", "َ", "ْ", "ٍ", "ِ", "ُ", "ُ", "ّ"];
			$.each(f,function(i,v) {
				val = val.replace(new RegExp(v, 'g'),r[i]);
			});
			
			return val;
			
		});
	}
});